Revit 2026 API

# APIObjectDispose Method

---

Causes the object to release immediately any resources it may be utilizing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Dispose()
```
```vb
Public Sub Dispose
```
```cpp
public:
virtual void Dispose() sealed
```
```fsharp
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposableDispose

This method is usually called implicitly by the programming language when the object is destroyed. After calling this method the object will no longer work correctly.

#### Reference

APIObject Class

Autodesk.Revit.DB Namespace